OpenNuvoton/M480BSP/Library/USB_Host/src_umas/UmasTransport.c
    if (srb->sc_data_direction == SCSI_DATA_WRITE)
        doDefault = 1;
    else {
        switch (lengths[srb->cmnd[0]]) {
        case 'L':
            len = srb->cmnd[4];
            break;
        case 'M':
            len = srb->cmnd[8];
            break;
        case '0':
        case '1':
        case '2':
        case '3':
        case '4':
        case '5':
        case '6':
        case '7':
        case '8':
        case '9':
            len = lengths[srb->cmnd[0]]-'0';
            break;
        case 'G':
            len = (((uint32_t)srb->cmnd[3])<<8) | srb->cmnd[4];
            break;
        case 'H':
            len = (((uint32_t)srb->cmnd[7])<<8) | srb->cmnd[8];
            break;
        case 'I':
            len = (((uint32_t)srb->cmnd[8])<<8) | srb->cmnd[9];
            break;
        case 'R':
            len = (((uint32_t)srb->cmnd[2])<<16) |
                  (((uint32_t)srb->cmnd[3])<<8) | srb->cmnd[4];
            break;
        case 'S':
            len = (((uint32_t)srb->cmnd[3])<<16) |
                  (((uint32_t)srb->cmnd[4])<<8) | srb->cmnd[5];
            break;
        case 'T':
            len = (((uint32_t)srb->cmnd[6])<<16) |
                  (((uint32_t)srb->cmnd[7])<<8) | srb->cmnd[8];
            break;
        case 'U':
            len = (((uint32_t)srb->cmnd[7])<<16) |
                  (((uint32_t)srb->cmnd[8])<<8) | srb->cmnd[9];
            break;
        case 'C':
            len = (((uint32_t)srb->cmnd[2])<<24) |
                  (((uint32_t)srb->cmnd[3])<<16) |
                  (((uint32_t)srb->cmnd[4])<<8) | srb->cmnd[5];
            break;
        case 'D':
            len = (((uint32_t)srb->cmnd[6])<<24) |
                  (((uint32_t)srb->cmnd[7])<<16) |
                  (((uint32_t)srb->cmnd[8])<<8) | srb->cmnd[9];
            break;
        case 'V':
            len = 20;
            break;
        case 'W':
            len = 24;
            break;
        case 'B':
            /* Use buffer size due to different block sizes */
            doDefault = 1;
            break;
        case 'X':
            UMAS_DEBUG("Error: UNSUPPORTED COMMAND %02X\n", srb->cmnd[0]);
            doDefault = 1;
            break;
        case 'Z':
            /* Use buffer size due to mode dependence */
            doDefault = 1;
            break;
        default:
            UMAS_DEBUG("Error: COMMAND %02X out of range or table inconsistent (%c).\n",
                       srb->cmnd[0], lengths[srb->cmnd[0]] );
            doDefault = 1;
        } /* end of switch */
    }

    if (doDefault == 1) {
        /* Are we going to scatter gather? */
        if (srb->use_sg) {
            /* Add up the sizes of all the sg segments */
            sg = (SCATTER_LIST_T *) srb->request_buff;
            for (i=0; i<srb->use_sg; i++)
                total += sg[i].length;
            len = total;
        } else
            /* Just return the length of the buffer */
            len = srb->request_bufflen;
    }
    return len;
}



/* This is a version of usb_clear_halt() that doesn't read the status from
 * the device -- this is because some devices crash their internal firmware
 * when the status is requested after a halt
 */
static int  clear_halt(struct usb_device *dev, int pipe)
{
    int    result;
    int    endp = usb_pipeendpoint(pipe) | (usb_pipein(pipe) << 7);

    UMAS_DEBUG("clear_halt!\n");
    result = usb_control_msg(dev, usb_sndctrlpipe(dev, 0),
                             USB_REQ_CLEAR_FEATURE, USB_RECIP_ENDPOINT, 0,
                             endp, NULL, 0, 0);
    /* this is a failure case */
    if (result < 0) {
        UMAS_DEBUG("clear_halt failed!!\n");
        return result;
    }

    /* reset the toggles and endpoint flags */
    //usb_endpoint_running(dev, usb_pipeendpoint(pipe), usb_pipeout(pipe));
    usb_settoggle(dev, usb_pipeendpoint(pipe), usb_pipeout(pipe), 0x1000);

    return 0;
}


volatile static int  _UmasUrbComplete;

int  is_urb_completed(void)
{
    return _UmasUrbComplete;
}

/***********************************************************************
 * Data transfer routines
 ***********************************************************************/
/*
 *  This is the completion handler which will wake us up when an URB
 *  completes.
 */
static void  usb_stor_blocking_completion(struct urb *urb)
{
    _UmasUrbComplete = 1;

#ifdef CONFIG_USB_STORAGE_DEBUG
    UMAS_DEBUG("usb_stor_blocking_completion called...\n");
#endif
}



/*
 *  This is our function to emulate usb_control_msg() but give us enough
 *  access to make aborts/resets work
 */
static int  usb_stor_control_msg(UMAS_DATA_T *umas, uint32_t pipe,
                                 uint8_t request, uint8_t requesttype, uint16_t value,
                                 uint16_t index, void *data, uint16_t size)
{
    struct urb  *urb = umas->current_urb;
    int    status;
    struct usb_ctrlrequest  *dr;

    /* allocate the device request structure */
    dr = USB_malloc(sizeof(struct usb_ctrlrequest), BOUNDARY_WORD);
    if (!dr)
        return -ENOMEM;

    /* fill in the structure */
    dr->bRequestType = requesttype;
    dr->bRequest = request;
#ifdef __BIG_ENDIAN
    dr->wValue = USB_SWAP16(value);
    dr->wIndex = USB_SWAP16(index);
    dr->wLength = USB_SWAP16(size);
#else
    dr->wValue = value;
    dr->wIndex = index;
    dr->wLength = size;
#endif

    /* fill the URB */
    usb_fill_control_urb(urb, umas->pusb_dev, pipe, (uint8_t *)dr, data, size,
                         usb_stor_blocking_completion, NULL);
    urb->actual_length = 0;
    urb->error_count = 0;
    //urb->transfer_flags = USB_ASYNC_UNLINK;

    _UmasUrbComplete = 0;

    /* submit the URB */
    status = usb_submit_urb(urb, 0);
    if (status) {
        /* something went wrong */
        USB_free(dr);
        return status;
    }

    /* wait for the completion of the URB */
    if (urb->status == -EINPROGRESS) {
        int  t0;

        t0 = umas_get_ticks();
        while (umas_get_ticks() - t0 < 600) {
            if (is_urb_completed())
                break;
        }

        if (umas_get_ticks() - t0 >= 600) {
            UMAS_DEBUG("usb_stor_control_msg time-out failed!\n");
            return -ETIMEDOUT;
        }
    }

    /* return the actual length of the data transferred if no error*/
    status = urb->status;
    if (status >= 0)
        status = urb->actual_length;

    USB_free(dr);
    return status;
}


