OpenNuvoton/M480BSP/Library/USB_Host/src_umas/UmasTransport.c
/*
 *  This is our function to emulate usb_bulk_msg() but give us enough
 *  access to make aborts/resets work
 */
static int  usb_stor_bulk_msg(UMAS_DATA_T *umas, void *data, int pipe,
                              uint32_t len, uint32_t *act_len)
{
    struct urb  *urb = umas->current_urb;
    int  status;

    /* fill the URB */
    usb_fill_bulk_urb(urb, umas->pusb_dev, pipe, data, len,
                      usb_stor_blocking_completion, NULL);
    urb->actual_length = 0;
    urb->error_count = 0;
    //urb->transfer_flags = USB_ASYNC_UNLINK;

    _UmasUrbComplete = 0;

    /* submit the URB */
    status = usb_submit_urb(urb, 0);
    if (status)
        return status;

    if (urb->status == -EINPROGRESS) {
        int  t0;

        t0 = umas_get_ticks();
        while (umas_get_ticks() - t0 < 3000) {
            if (is_urb_completed())
                break;
        }

        if (umas_get_ticks() - t0 >= 3000) {
            UMAS_DEBUG("usb_stor_bulk_msg time-out failed!  %d\n", t0);
            return -ETIMEDOUT;
        }
    }

    /* return the actual length of the data transferred */
    *act_len = urb->actual_length;

    return urb->status;
}



/*
 *  Transfer one SCSI scatter-gather buffer via bulk transfer
 *
 *  Note that this function is necessary because we want the ability to
 *  use scatter-gather memory.  Good performance is achieved by a combination
 *  of scatter-gather and clustering (which makes each chunk bigger).
 *
 *  Note that the lower layer will always retry when a NAK occurs, up to the
 *  timeout limit.  Thus we don't have to worry about it for individual
 *  packets.
 */
static int  usb_stor_transfer_partial(UMAS_DATA_T *umas, char *buf, int length)
{
    int     result;
    uint32_t  partial;
    int     pipe;

    /* calculate the appropriate pipe information */
    if (umas->srb->sc_data_direction == SCSI_DATA_READ)
        pipe = usb_rcvbulkpipe(umas->pusb_dev, umas->ep_in_num);
    else
        pipe = usb_sndbulkpipe(umas->pusb_dev, umas->ep_out_num);

    /* transfer the data */
    UMAS_VDEBUG("usb_stor_transfer_partial - xfer %d bytes\n", length);
    result = usb_stor_bulk_msg(umas, buf, pipe, length, &partial);
    UMAS_VDEBUG("usb_stor_bulk_msg() returned %d xferred %d/%d\n", result, partial, length);
    //UMAS_DEBUG("usb_stor_bulk_msg() returned %d xferred %d/%d\n", result, partial, length);

    /* if we stall, we need to clear it before we go on */
    if (result == -EPIPE) {
        UMAS_DEBUG("usb_stor_transfer_partial - clearing endpoint halt for pipe 0x%x\n", pipe);
        clear_halt(umas->pusb_dev, pipe);
    }

    /* did we send all the data? */
    if (partial == length) {
        UMAS_VDEBUG("usb_stor_transfer_partial - transfer complete\n");
        return UMAS_BULK_TRANSFER_GOOD;
    }

    /* uh oh... we have an error code, so something went wrong. */
    if (result) {
        /* NAK - that means we've retried a few times already */
        if (result == -ETIMEDOUT) {
            UMAS_DEBUG("usb_stor_transfer_partial - device NAKed\n");
            return UMAS_BULK_TRANSFER_FAILED;
        }

        /* -ENOENT -- we canceled this transfer */
        if (result == -ENOENT) {
            UMAS_DEBUG("usb_stor_transfer_partial - transfer aborted\n");
            return UMAS_BULK_TRANSFER_ABORTED;
        }

        /* the catch-all case */
        UMAS_DEBUG("usb_stor_transfer_partial - unknown error\n");
        return UMAS_BULK_TRANSFER_FAILED;
    }

    /* no error code, so we must have transferred some data, just not all of it */
    return UMAS_BULK_TRANSFER_SHORT;
}



/*
 *  Transfer an entire SCSI command's worth of data payload over the bulk pipe.
 *
 *  Note that this uses usb_stor_transfer_partial to achieve it's goals -- this
 *  function simply determines if we're going to use scatter-gather or not,
 *  and acts appropriately.  For now, it also re-interprets the error codes.
 */
static void  us_transfer(SCSI_CMD_T *srb, UMAS_DATA_T* umas)
{
    int     i;
    int     result = -1;
    uint32_t  total_transferred = 0;
    uint32_t  transfer_amount;
    SCATTER_LIST_T  *sg;

    /* calculate how much we want to transfer */
    transfer_amount = usb_stor_transfer_length(srb);

    /* Was someone foolish enough to request more data than available buffer space?  */
    if (transfer_amount > srb->request_bufflen)
        transfer_amount = srb->request_bufflen;

    /* are we scatter-gathering? */
    if (srb->use_sg) {
        /*
         * loop over all the scatter gather structures and
         * make the appropriate requests for each, until done
         */
        sg = (SCATTER_LIST_T *) srb->request_buff;
        for (i = 0; i < srb->use_sg; i++) {
            /* transfer the lesser of the next buffer or the remaining data */
            if (transfer_amount - total_transferred >= sg[i].length) {
                result = usb_stor_transfer_partial(umas, sg[i].address, sg[i].length);
                total_transferred += sg[i].length;
            } else
                result = usb_stor_transfer_partial(umas, sg[i].address,
                                                   transfer_amount - total_transferred);
            /* if we get an error, end the loop here */
            if (result)
                break;
        }
    } else /* no scatter-gather, just make the request */
        result = usb_stor_transfer_partial(umas, (char *)srb->request_buff, transfer_amount);

    /* return the result in the data structure itself */
    srb->result = result;
}



/***********************************************************************
 * Transport routines
 ***********************************************************************/

/*
 *  Invoke the transport and basic error-handling/recovery methods
 *
 *  This is used by the protocol layers to actually send the message to
 *  the device and receive the response.
 */
void  UMAS_InvokeTransport(SCSI_CMD_T *srb, UMAS_DATA_T *umas)
{
    int    need_auto_sense;
    int    result;

    /* send the command to the transport layer */
    result = umas->transport(srb, umas);

