OpenNuvoton/M480BSP/Library/USB_Host/src_umas/UmasTransport.c
    /*
     * If the command gets aborted by the higher layers, we need to
     * short-circuit all other processing
     */
    if (result == USB_STOR_TRANSPORT_ABORTED) {
        UMAS_DEBUG("UMAS_InvokeTransport - transport indicates command was aborted\n");
        srb->result = DID_ABORT << 16;
        return;
    }

    /*
     * Determine if we need to auto-sense
     *
     * I normally don't use a flag like this, but it's almost impossible
     * to understand what's going on here if I don't.
     */
    need_auto_sense = 0;

    /*
     * If we're running the CB transport, which is incapable
     * of determining status on it's own, we need to auto-sense almost
     * every time.
     */
    if ((umas->protocol == UMAS_PR_CB) || (umas->protocol == UMAS_PR_DPCM_USB)) {
        UMAS_VDEBUG("UMAS_InvokeTransport - CB transport device requiring auto-sense\n");
        need_auto_sense = 1;

        /*
         * There are some exceptions to this.  Notably, if this is
         * a UFI device and the command is REQUEST_SENSE or INQUIRY,
         * then it is impossible to truly determine status.
         */
        if ((umas->subclass == UMAS_SC_UFI) &&
                ((srb->cmnd[0] == REQUEST_SENSE) || (srb->cmnd[0] == INQUIRY))) {
            UMAS_DEBUG("UMAS_InvokeTransport - no auto-sense for a special command\n");
            need_auto_sense = 0;
        }
    }

    /*
     * If we have an error, we're going to do a REQUEST_SENSE
     * automatically.  Note that we differentiate between a command
     * "failure" and an "error" in the transport mechanism.
     */
    if (result == USB_STOR_TRANSPORT_FAILED) {
        UMAS_VDEBUG("UMAS_InvokeTransport - transport indicates command failure\n");
        need_auto_sense = 1;
    }
    if (result == USB_STOR_TRANSPORT_ERROR) {
#if 1  /* YCHuang, 2003.06.30 */
        //umas->transport_reset(umas);
        UMAS_DEBUG("UMAS_InvokeTransport - transport indicates transport error\n");
#endif
        need_auto_sense = 0;
        srb->result = DID_ERROR << 16;
        return;
    }

    /*
     * Also, if we have a short transfer on a command that can't have
     * a short transfer, we're going to do this.
     */
    if ((srb->result == UMAS_BULK_TRANSFER_SHORT) &&
            !((srb->cmnd[0] == REQUEST_SENSE) ||
              (srb->cmnd[0] == INQUIRY) ||
              (srb->cmnd[0] == MODE_SENSE) ||
              (srb->cmnd[0] == LOG_SENSE) ||
              (srb->cmnd[0] == MODE_SENSE_10))) {
        UMAS_DEBUG("UMAS_InvokeTransport - unexpectedly short transfer\n");
        need_auto_sense = 1;
    }

    /* Now, if we need to do the auto-sense, let's do it */
    if (need_auto_sense) {
        int     temp_result;
        void    *old_request_buffer;
        uint16_t  old_sg;
        uint32_t  old_request_bufflen;
        uint8_t   old_sc_data_direction;
        uint8_t   old_cmnd[MAX_COMMAND_SIZE];

        UMAS_VDEBUG("UMAS_InvokeTransport - Issuing auto-REQUEST_SENSE\n");

        /* save the old command */
        memcpy(old_cmnd, srb->cmnd, MAX_COMMAND_SIZE);

        /* set the command and the LUN */
        srb->cmnd[0] = REQUEST_SENSE;
        srb->cmnd[1] = old_cmnd[1] & 0xE0;
        srb->cmnd[2] = 0;
        srb->cmnd[3] = 0;
        srb->cmnd[4] = 18;
        srb->cmnd[5] = 0;

        /* set the transfer direction */
        old_sc_data_direction = srb->sc_data_direction;
        srb->sc_data_direction = SCSI_DATA_READ;

        /* use the new buffer we have */
        old_request_buffer = srb->request_buff;
        srb->request_buff = srb->sense_buffer;

        /* set the buffer length for transfer */
        old_request_bufflen = srb->request_bufflen;
        srb->request_bufflen = 18;

        /* set up for no scatter-gather use */
        old_sg = srb->use_sg;
        srb->use_sg = 0;

        /* issue the auto-sense command */
        temp_result = umas->transport(umas->srb, umas);
        if (temp_result != USB_STOR_TRANSPORT_GOOD) {
            UMAS_DEBUG("-- auto-sense failure\n");

            /*
             * we skip the reset if this happens to be a
             * multi-target device, since failure of an
             * auto-sense is perfectly valid
             */
            if (!(umas->flags & UMAS_FL_SCM_MULT_TARG)) {
                umas->transport_reset(umas);
                printf("transport_reset!!\n");
            }
            srb->result = DID_ERROR << 16;
            return;
        }

        UMAS_VDEBUG("-- Result from auto-sense is %d\n", temp_result);
        UMAS_VDEBUG("-- code: 0x%x, key: 0x%x, ASC: 0x%x, ASCQ: 0x%x\n",
                    srb->sense_buffer[0], srb->sense_buffer[2] & 0xf,
                    srb->sense_buffer[12], srb->sense_buffer[13]);
#ifdef CONFIG_USB_STORAGE_DEBUG
        UMAS_DEBUG_ShowSense(srb->sense_buffer[2] & 0xf,
                             srb->sense_buffer[12], srb->sense_buffer[13]);
#endif

        /* set the result so the higher layers expect this data */
        srb->result = CHECK_CONDITION << 1;

        /* we're done here, let's clean up */
        srb->request_buff = old_request_buffer;
        srb->request_bufflen = old_request_bufflen;
        srb->use_sg = old_sg;
        srb->sc_data_direction = old_sc_data_direction;
        memcpy(srb->cmnd, old_cmnd, MAX_COMMAND_SIZE);

        /* If things are really okay, then let's show that */
        if ((srb->sense_buffer[2] & 0xf) == 0x0)
            srb->result = GOOD << 1;
    } else /* if (need_auto_sense) */
        srb->result = GOOD << 1;

    /*
     * Regardless of auto-sense, if we _know_ we have an error
     * condition, show that in the result code
     */
    if (result == USB_STOR_TRANSPORT_FAILED)
        srb->result = CHECK_CONDITION << 1;

    /*
     * If we think we're good, then make sure the sense data shows it.
     * This is necessary because the auto-sense for some devices always
     * sets byte 0 == 0x70, even if there is no error
     */
    if ((umas->protocol == UMAS_PR_CB || umas->protocol == UMAS_PR_DPCM_USB) &&
            (result == USB_STOR_TRANSPORT_GOOD) && ((srb->sense_buffer[2] & 0xf) == 0x0))
        srb->sense_buffer[0] = 0x0;
}



