OpenNuvoton/M480BSP/Library/USB_Host/src_umas/UmasTransport.c
/*
 * Control/Bulk/Interrupt transport
 */

/* The interrupt handler for CBI devices */
void  UMAS_CbiIrq(struct urb *urb)
{
    UMAS_DATA_T  *umas = (UMAS_DATA_T *)urb->context;

    UMAS_VDEBUG("UMAS_CbiIrq - len=%d, state=%d, status=(0x%x 0x%x)\n", urb->actual_length, urb->status, umas->irqbuf[0], umas->irqbuf[1]);

    /* reject improper IRQs */
    if (urb->actual_length != 2) {
        UMAS_DEBUG("-- IRQ too short\n");
        return;
    }

    /* is the device removed? */
    if (urb->status == -ENOENT) {
        UMAS_DEBUG("-- device has been removed\n");
        return;
    }

    /* was this a command-completion interrupt? */
    if (umas->irqbuf[0] && (umas->subclass != UMAS_SC_UFI)) {
        UMAS_DEBUG("-- not a command-completion IRQ\n");
        return;
    }

#if 0
    /* was this a wanted interrupt? */
    if (!umas->ip_wanted) {
        UMAS_DEBUG("ERROR: Unwanted interrupt received!\n");
        return;
    }
#endif
    umas->ip_wanted = 0 ;

    /* copy the valid data */
    umas->irqdata[0] = umas->irqbuf[0];
    umas->irqdata[1] = umas->irqbuf[1];

    /* wake up the command thread */
#ifdef _LINUX_
    UMAS_VDEBUG("-- Current value of ip_waitq is: %d\n", atomic_read(&umas->ip_waitq.count));
    up(&(umas->ip_waitq));
#endif
}



int  UMAS_CbiTransport(SCSI_CMD_T *srb, UMAS_DATA_T *umas)
{
    int result;

    /* Set up for status notification */
#ifdef _LINUX_
    atomic_set(umas->ip_wanted, 1);
#else
    umas->ip_wanted = 1;
#endif

    /* re-initialize the mutex so that we avoid any races with
     * early/late IRQs from previous commands */

    /* COMMAND STAGE */
    /* let's send the command via the control pipe */
    result = usb_stor_control_msg(umas, usb_sndctrlpipe(umas->pusb_dev,0),
                                  US_CBI_ADSC,
                                  USB_TYPE_CLASS | USB_RECIP_INTERFACE, 0,
                                  umas->intf->cur_altsetting->desc.bInterfaceNumber,
                                  srb->cmnd, srb->cmd_len);

    /* check the return code for the command */
    UMAS_VDEBUG("Call to usb_stor_control_msg() returned %d\n", result);
    if (result < 0) {
#ifdef _LINUX_
        /* Reset flag for status notification */
        atomic_set(umas->ip_wanted, 0);
#endif

        /* if the command was aborted, indicate that */
        if (result == -ENOENT)
            return USB_STOR_TRANSPORT_ABORTED;

        /* STALL must be cleared when they are detected */
        if (result == -EPIPE) {
            UMAS_VDEBUG("-- Stall on control pipe. Clearing\n");
            result = clear_halt(umas->pusb_dev,  usb_sndctrlpipe(umas->pusb_dev, 0));
            UMAS_VDEBUG("-- clear_halt() returns %d\n", result);
            return USB_STOR_TRANSPORT_FAILED;
        }

        /* Uh oh... serious problem here */
        return USB_STOR_TRANSPORT_ERROR;
    }

    /* DATA STAGE */
    /* transfer the data payload for this command, if one exists*/
    if (usb_stor_transfer_length(srb)) {
        us_transfer(srb, umas);
        UMAS_VDEBUG("CBI data stage result is 0x%x\n", srb->result);

        /* if it was aborted, we need to indicate that */
        if (srb->result == USB_STOR_TRANSPORT_ABORTED)
            return USB_STOR_TRANSPORT_ABORTED;

    }

    /* STATUS STAGE */

    //UMAS_VDEBUG("Current value of ip_waitq is: %d\n", umas->ip_waitq.count);

    /* if we were woken up by an abort instead of the actual interrupt */
    if (umas->ip_wanted) {
        UMAS_DEBUG("Did not get interrupt on CBI\n");
        umas->ip_wanted = 0;
        return USB_STOR_TRANSPORT_ABORTED;
    }

    UMAS_VDEBUG("Got interrupt data (0x%x, 0x%x)\n",  umas->irqdata[0], umas->irqdata[1]);

    /*
     *  UFI gives umas ASC and ASCQ, like a request sense
     *
     *  REQUEST_SENSE and INQUIRY don't affect the sense data on UFI
     *  devices, so we ignore the information for those commands.  Note
     *  that this means we could be ignoring a real error on these
     *  commands, but that can't be helped.
     */
    if (umas->subclass == UMAS_SC_UFI) {
        if ((srb->cmnd[0] == REQUEST_SENSE) || (srb->cmnd[0] == INQUIRY))
            return USB_STOR_TRANSPORT_GOOD;
        else {
            if (((uint8_t*)umas->irq_urb->transfer_buffer)[0])
                return USB_STOR_TRANSPORT_FAILED;
            else
                return USB_STOR_TRANSPORT_GOOD;
        }
    }

    /*
     *  If not UFI, we interpret the data as a result code
     *  The first byte should always be a 0x0
     *  The second byte & 0x0F should be 0x0 for good, otherwise error
     */
    if (umas->irqdata[0]) {
        UMAS_VDEBUG("CBI IRQ data showed reserved bType %d\n", umas->irqdata[0]);
        return USB_STOR_TRANSPORT_ERROR;
    }

    switch (umas->irqdata[1] & 0x0F) {
    case 0x00:
        return USB_STOR_TRANSPORT_GOOD;
    case 0x01:
        return USB_STOR_TRANSPORT_FAILED;
    default:
        return USB_STOR_TRANSPORT_ERROR;
    }

    /* we should never get here, but if we do, we're in trouble */
    //return USB_STOR_TRANSPORT_ERROR;
}



/*
 * Control/Bulk transport
 */
int  UMAS_CbTransport(SCSI_CMD_T *srb, UMAS_DATA_T *umas)
{
    int    result;

    /* COMMAND STAGE */
    /* let's send the command via the control pipe */
    result = usb_stor_control_msg(umas, usb_sndctrlpipe(umas->pusb_dev,0),
                                  US_CBI_ADSC,
                                  USB_TYPE_CLASS | USB_RECIP_INTERFACE, 0,
                                  umas->intf->cur_altsetting->desc.bInterfaceNumber,
                                  srb->cmnd, srb->cmd_len);

    /* check the return code for the command */
    UMAS_VDEBUG("UMAS_CbTransport - Call to usb_stor_control_msg() returned %d\n", result);
    if (result < 0) {
        /* if the command was aborted, indicate that */
        if (result == -ENOENT)
            return USB_STOR_TRANSPORT_ABORTED;

        /* a stall is a fatal condition from the device */
        if (result == -EPIPE) {
            UMAS_DEBUG("UMAS_CbTransport - Stall on control pipe. Clearing\n");
            result = clear_halt(umas->pusb_dev, usb_sndctrlpipe(umas->pusb_dev, 0));
            UMAS_DEBUG("UMAS_CbTransport - clear_halt() returns %d\n", result);
            return USB_STOR_TRANSPORT_FAILED;
        }

        /* Uh oh... serious problem here */
        return USB_STOR_TRANSPORT_ERROR;
    }

