OpenNuvoton/M480BSP/Library/USB_Host/src_umas/UmasTransport.c
    /* DATA STAGE */
    /* transfer the data payload for this command, if one exists */
    if (usb_stor_transfer_length(srb)) {
        us_transfer(srb, umas);
        UMAS_VDEBUG("UMAS_CbTransport - CB data stage result is 0x%x\n", srb->result);

        /* if it was aborted, we need to indicate that */
        if (srb->result == USB_STOR_TRANSPORT_ABORTED)
            return USB_STOR_TRANSPORT_ABORTED;
    }

    /* STATUS STAGE */
    /* NOTE: CB does not have a status stage.  Silly, I know.  So
     * we have to catch this at a higher level.
     */
    return USB_STOR_TRANSPORT_GOOD;
}



/*
 * Bulk only transport
 */

/* Determine what the maximum LUN supported is */
int  UMAS_BulkMaxLun(UMAS_DATA_T *umas)
{
    uint8_t     data;
    int     result;
    int     pipe;
    uint8_t   *dma_buff;

    dma_buff = USB_malloc(1, BOUNDARY_WORD);

    /* issue the command */
    pipe = usb_rcvctrlpipe(umas->pusb_dev, 0);
    result = usb_control_msg(umas->pusb_dev, pipe, UMAS_BULK_GET_MAX_LUN,
                             USB_DIR_IN | USB_TYPE_CLASS | USB_RECIP_INTERFACE,
                             0, umas->intf->cur_altsetting->desc.bInterfaceNumber,
                             dma_buff, 1, 0);

    data = dma_buff[0];
    USB_free(dma_buff);

    UMAS_DEBUG("GetMaxLUN command result is %d, data is %d\n", result, data);

    /* if we have a successful request, return the result */
    if (result == 1)
        return data;

    /* if we get a STALL, clear the stall */
    if (result == -EPIPE) {
        UMAS_DEBUG("clearing endpoint halt for pipe 0x%x\n", pipe);
        clear_halt(umas->pusb_dev, pipe);
    }

    /* return the default -- no LUNs */
    return 0;
}



int  UMAS_BulkTransport(SCSI_CMD_T *srb, UMAS_DATA_T *umas)
{
    struct bulk_cb_wrap  *bcb;
    struct bulk_cs_wrap  *bcs;
    int     result, status = 0;
    int     pipe;
    uint32_t    partial;

    /* if the device was removed, then we're already reset */
    if (!umas->pusb_dev)
        return SUCCESS;

    bcb = USB_malloc(sizeof(struct bulk_cb_wrap), BOUNDARY_WORD);
    bcs = USB_malloc(sizeof(struct bulk_cs_wrap), BOUNDARY_WORD);
    if ((bcb == NULL) || (bcs == NULL)) {
        UMAS_DEBUG("UMAS_BulkTransport - Memory not enough!\n");
        status = USB_STOR_TRANSPORT_FAILED;
        goto bulk_error;
    }

    /* set up the command wrapper */
    bcb->Signature = UMAS_BULK_CB_SIGN;
    bcb->DataTransferLength = usb_stor_transfer_length(srb);
#ifdef __BIG_ENDIAN
    bcb->Signature = USB_SWAP32(bcb->Signature);
    bcb->DataTransferLength = USB_SWAP32(bcb->DataTransferLength);
#endif
    bcb->Flags = srb->sc_data_direction == SCSI_DATA_READ ? 1 << 7 : 0;
    bcb->Tag = srb->serial_number;
    bcb->Lun = srb->cmnd[1] >> 5;

    if (umas->flags & UMAS_FL_SCM_MULT_TARG)
        bcb->Lun |= srb->target << 4;
    bcb->Length = srb->cmd_len;

    /* construct the pipe handle */
    pipe = usb_sndbulkpipe(umas->pusb_dev, umas->ep_out_num);

    /* copy the command payload */
    memset(bcb->CDB, 0, sizeof(bcb->CDB));
    memcpy(bcb->CDB, srb->cmnd, bcb->Length);

    /* send it to out endpoint */
    UMAS_VDEBUG("Bulk command S 0x%x T 0x%x Trg %d LUN %d L %d F %d CL %d\n",
                bcb->Signature, bcb->Tag, (bcb->Lun >> 4), (bcb->Lun & 0x0F),
                bcb->DataTransferLength, bcb->Flags, bcb->Length);
    result = usb_stor_bulk_msg(umas, (char *)bcb, pipe, UMAS_BULK_CB_WRAP_LEN, &partial);
    UMAS_VDEBUG("Bulk command transfer result=%d\n", result);

    /* if the command was aborted, indicate that */
    if (result == -ENOENT)
        return USB_STOR_TRANSPORT_ABORTED;

    /* if we stall, we need to clear it before we go on */
    if (result == -EPIPE) {
        UMAS_DEBUG("UMAS_BulkTransport - 1 clearing endpoint halt for pipe 0x%x\n", pipe);
        clear_halt(umas->pusb_dev, pipe);
    } else if (result) {
        /* unknown error -- we've got a problem */
        status = USB_STOR_TRANSPORT_ERROR;
        goto bulk_error;
    }

    /* if the command transferred well, then we go to the data stage */
    if (result == 0) {
        /* send/receive data payload, if there is any */
        if (bcb->DataTransferLength) {
            us_transfer(srb, umas);

            /* if it was aborted, we need to indicate that */
            if (srb->result == USB_STOR_TRANSPORT_ABORTED) {
                status = USB_STOR_TRANSPORT_ABORTED;
                goto bulk_error;
            }
        }
    }

    /*
     *  See flow chart on pg 15 of the Bulk Only Transport spec for
     *  an explanation of how this code works.
     */

    /* construct the pipe handle */
    pipe = usb_rcvbulkpipe(umas->pusb_dev, umas->ep_in_num);

    /* get CSW for device status */
    UMAS_VDEBUG("Attempting to get CSW...\n");
    result = usb_stor_bulk_msg(umas, (char *)bcs, pipe, UMAS_BULK_CS_WRAP_LEN, &partial);

    /* if the command was aborted, indicate that */
    if (result == -ENOENT) {
        status = USB_STOR_TRANSPORT_ABORTED;
        goto bulk_error;
    }

    /* did the attempt to read the CSW fail? */
    if (result == -EPIPE) {
        UMAS_DEBUG("get CSW failed - clearing endpoint halt for pipe 0x%x\n", pipe);
        clear_halt(umas->pusb_dev, pipe);

        /* get the status again */
        UMAS_DEBUG("Attempting to get CSW (2nd try)...\n");
        result = usb_stor_bulk_msg(umas, (char *)bcs, pipe, UMAS_BULK_CS_WRAP_LEN, &partial);

        /* if the command was aborted, indicate that */
        if (result == -ENOENT) {
            UMAS_DEBUG("get CSW Command was aborted!\n");
            status = USB_STOR_TRANSPORT_ABORTED;
            goto bulk_error;
        }

        /* if it fails again, we need a reset and return an error*/
        if (result == -EPIPE) {
            UMAS_DEBUG("get CSW command 2nd try failed - clearing halt for pipe 0x%x\n", pipe);
            clear_halt(umas->pusb_dev, pipe);
            status = USB_STOR_TRANSPORT_ERROR;
            goto bulk_error;
        }
    }

    /* if we still have a failure at this point, we're in trouble */
    UMAS_VDEBUG("Bulk status result = %d\n", result);
    if (result) {
        status = USB_STOR_TRANSPORT_ERROR;
        goto bulk_error;
    }

#ifdef __BIG_ENDIAN
    bcs->Signature = USB_SWAP32(bcs->Signature);
#endif

    /* check bulk status */
    UMAS_VDEBUG("Bulk status Sig 0x%x T 0x%x R %d Stat 0x%x\n",
                USB_SWAP32(bcs->Signature), bcs->Tag, bcs->Residue, bcs->Status);
    if ((bcs->Signature != UMAS_BULK_CS_SIGN) || (bcs->Tag != bcb->Tag) ||
            (bcs->Status > UMAS_BULK_STAT_PHASE) || (partial != 13)) {
        UMAS_DEBUG("Bulk status Sig 0x%x T 0x%x R %d Stat 0x%x\n",
                   USB_SWAP32(bcs->Signature), bcs->Tag, bcs->Residue, bcs->Status);
        status = USB_STOR_TRANSPORT_ERROR;
        goto bulk_error;
    }

    /* based on the status code, we report good or bad */
    switch (bcs->Status) {
    case UMAS_BULK_STAT_OK:
        /* command good -- note that data could be short */
        USB_free(bcb);
        USB_free(bcs);
        return USB_STOR_TRANSPORT_GOOD;

