OpenNuvoton/M480BSP/Library/USB_Host/src_umas/UmasTransport.c
    case UMAS_BULK_STAT_FAIL:
        /* command failed */
        status = USB_STOR_TRANSPORT_FAILED;
        goto bulk_error;

    case UMAS_BULK_STAT_PHASE:
        /* phase error -- note that a transport reset will be
         * invoked by the invoke_transport() function
         */
        status = USB_STOR_TRANSPORT_ERROR;
        goto bulk_error;
    }
    /* we should never get here, but if we do, we're in trouble */

bulk_error:
    USB_free(bcb);
    USB_free(bcs);
    return status;
}




/***********************************************************************
 * Reset routines
 ***********************************************************************/

/*
 *  This issues a CB[I] Reset to the device in question
 */
int  UMAS_CbReset(UMAS_DATA_T *umas)
{
    uint8_t   cmd[12];
    int     result;

    /* if the device was removed, then we're already reset */
    if (!umas->pusb_dev)
        return SUCCESS;

    memset(cmd, 0xFF, sizeof(cmd));
    cmd[0] = SEND_DIAGNOSTIC;
    cmd[1] = 4;
    result = usb_control_msg(umas->pusb_dev, usb_sndctrlpipe(umas->pusb_dev,0),
                             US_CBI_ADSC, USB_TYPE_CLASS | USB_RECIP_INTERFACE,
                             0, umas->intf->cur_altsetting->desc.bInterfaceNumber,
                             cmd, sizeof(cmd), 0);
    if (result < 0) {
        UMAS_DEBUG("UMAS_CbReset - CB[I] soft reset failed %d\n", result);
        return FAILED;
    }

#ifdef _LINUX_
    /* long wait for reset */
    set_current_state(TASK_UNINTERRUPTIBLE);
    schedule_timeout(HZ*6);
    set_current_state(TASK_RUNNING);
#endif

    UMAS_VDEBUG("UMAS_CbReset - clearing endpoint halt\n");
    clear_halt(umas->pusb_dev, usb_rcvbulkpipe(umas->pusb_dev, umas->ep_in_num));
    clear_halt(umas->pusb_dev, usb_rcvbulkpipe(umas->pusb_dev, umas->ep_out_num));

    UMAS_VDEBUG("UMAS_CbReset - done\n");
    /* return a result code based on the result of the control message */
    return SUCCESS;
}



/*
 *  This issues a Bulk-only Reset to the device in question, including
 *  clearing the subsequent endpoint halts that may occur.
 */
int  UMAS_BulkReset(UMAS_DATA_T *umas)
{
    int result;

    UMAS_VDEBUG("Bulk reset requested\n");

    /* if the device was removed, then we're already reset */
    if (!umas->pusb_dev)
        return SUCCESS;

    result = usb_control_msg(umas->pusb_dev,
                             usb_sndctrlpipe(umas->pusb_dev,0), UMAS_BULK_RESET_REQUEST,
                             USB_TYPE_CLASS | USB_RECIP_INTERFACE, 0,
                             umas->intf->cur_altsetting->desc.bInterfaceNumber,
                             NULL, 0, 1000);
    if (result < 0) {
        UMAS_DEBUG("Bulk soft reset failed %d\n", result);
        return FAILED;
    }

    {
        int t0;
        t0 = get_ticks();
        while (get_ticks() - t0 < 10)
            ;
    }

    clear_halt(umas->pusb_dev, usb_rcvbulkpipe(umas->pusb_dev, umas->ep_in_num));
    clear_halt(umas->pusb_dev, usb_sndbulkpipe(umas->pusb_dev, umas->ep_out_num));

    UMAS_VDEBUG("Bulk soft reset completed\n");
    return SUCCESS;
}

